# omz libs needed for some plugins and themes
ohmyzsh/ohmyzsh path:lib

# --------------------
# theme
# --------------------
# af-magic theme
ohmyzsh/ohmyzsh path:themes/af-magic.zsh-theme

# --------------------
# plugins
# --------------------

# loads ssh keys using ssh-agent
ohmyzsh/ohmyzsh path:plugins/ssh-agent

# fzf integration
unixorn/fzf-zsh-plugin

# hints for previously executed commands
zsh-users/zsh-autosuggestions

# adds more completion scripts
zsh-users/zsh-completions

# adds syntax highlighting to the prompt
zsh-users/zsh-syntax-highlighting

# prepends sudo to a command when [Esc] [Esc] is pressed
ohmyzsh/ohmyzsh path:plugins/sudo

# adds tmux aliases and starts tmux automatically
# enable autostart with 
# export ZSH_TMUX_AUTOSTART=true
# ~/.zshenv
ohmyzsh/ohmyzsh path:plugins/tmux